{
   "httpStatus":"OK",
   "httpStatusCode":200,
   "success":true,
   "message":"Question categories fetched successfully.",
   "apiName":"Get all categories.",
   "data":[
      {
         "id":4,
         "name":"Love",
         "description":"",
         "price":99.0,
         "suggestions":[
            "When is the right for me to introduce my boyfriend / girlfriend?",
            "Doubtful about taking my relationship to next level?",
            "How will I meet my potential life partner?",
            "Is my wife/Husband faithful?",
            "Will I ever meet my true love?",
            "When will I get in relationship?"
         ]
      },
      {
         "id":6,
         "name":"Business",
         "description":"",
         "price":99.0,
         "suggestions":[
            "Am I a good businessman according to by chart?",
            "I want to start my own business. Will I be successful?",
            "Which is the best place to invest my money?",
            "Should I partner with my friend in his new business?",
            "I am taking a new project. Will I make money?",
            "Should I start a new business with my brother?",
            "Which sector is a good sector for business?",
            "I started my business but failed. Should I try again?",
            "My business is not running well. What should I do?",
            "What do my employees think of me?",
            "My partners are not agreeing to new deal. Should I go independently?",
            "How will this year be for my business?",
            "Will I get in trouble with government for my business?",
            "New competitors have entered by business. How will I perform against them?"
         ]
      },
      {
         "id":7,
         "name":"Education",
         "description":"",
         "price":99.0,
         "suggestions":[
            "What is the best field for me to study?",
            "Will I get admission in my choice of college?",
            "Will I get selected in medical college this year?",
            "Is doing engineering good for my career?",
            "How will I perform in 10 boards this year?",
            "Will I pass my 12 boards this year?",
            "Should I opt for science or commerce? What is best for me?",
            "What do my classmates think of me?",
            "What does my school friends thing of me?",
            "I failed this year, what went wrong?",
            "Will I pass this year? I am nervous",
            "I got selected in 2 colleges. Which is the best college for me? ",
            "I graduated last year but unable to find a job? Please advice.",
            "Will I be able to go abroad for higher education?"
         ]
      },
      {
         "id":12,
         "name":"Work",
         "description":"",
         "price":99.0,
         "suggestions":[
            "When will I get a job?",
            "Which field is good for me?",
            "I have a job interview tomorrow. Will I get selected?",
            "What do my work colleagues think of me?",
            "How will I perform this year in my job?",
            "I feel my boss is not happy with me. What should I do?",
            "Should I move to a new city for a job offer? Will it help my career?",
            "I am stuck in sales job and not happy. What is your advice on my current job?",
            "What are the best colours for me to wear in job interview?",
            "When is the good time to search for a new job?",
            "I think my colleagues don’t like me. What should I do?",
            "I want to work abroad. Will I get a job outside?"
         ]
      },
      {
         "id":13,
         "name":"Self",
         "description":"",
         "price":99.0,
         "suggestions":[
            "Which is the right path for me ?",
            "Where and what is my potential?",
            "Do people around me like me?",
            "Which gemstone is suitable for me?",
            "Does my future hold success?",
            "What do stars say about my life?"
         ]
      },
      {
         "id":14,
         "name":"Life",
         "description":"",
         "price":99.0,
         "suggestions":[
            "Are there any surprises for me this week?",
            "What do my friends and family think about me?",
            "Feeling nervous about my test this week? How will it go?",
            "How will my day go today?",
            "What is the best time to move into my new house?",
            "What should I do to make balance my life?",
            "Is it a favourable time to buy a new car?",
            "Is it a right time to buy a new house?",
            "What is the right time to sell property?",
            "I don’t feel positive these days? Whats wrong?",
            "Lot of negativity around my life? What should I do?",
            "What is the right time to join new company?",
            "When is the right time to start my own business?"
         ]
      },
      {
         "id":15,
         "name":"Money",
         "description":"",
         "price":99.0,
         "suggestions":[
            "Will I become financially secure?",
            "Will I become rich one day?",
            "When will I get financially independent?",
            "Will my loan for new house get approved?",
            "Will my loan to start a new business get approved?",
            "What is the best time to apply for a loan?",
            "I am never able to save money. What should I do?",
            "How will the money flow in my life?",
            "When is the best time to take a car loan?",
            "I always think about making money. Is it good or bad?",
            "Which job can I earn the most?",
            "Should I change my job to make more money?"
         ]
      }
   ]
}